tunr_app_api/app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist", "duration", "favorite", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "rolling In the deep"], ["artist", "adele"], ["duration", "3:29"], ["favorite", true], ["created_at", "2020-08-07 18:15:36.088976"], ["updated_at", "2020-08-07 18:15:36.088976"]]
---
  def create
    @song = Song.new(song_params)

    if @song.save

UPDATE "songs" SET "title" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["title", "rolling In the deep"], ["updated_at", "2020-08-07 03:42:02.827159"], ["id", 12]]
---
  def update
    if @song.update(song_params)